<?php

return [
    'accounts' => [
        'created' => 'Счет создан успешно!',
        'updated' => 'Счет обновлен успешно!',
        'deleted' => 'Счет удален успешно.',
        'error' => 'Произошла ошибка при попытке сохранить счет. Пожалуйста, попробуйте еще раз.',
    ],
    'bills' => [
        'created' => 'Регулярный платеж создан успешно!',
        'updated' => 'Регулярный платеж обновлен успешно!',
        'deleted' => 'Регулярный платеж удален успешно.',
        'error' => 'Произошла ошибка при попытке сохранить регулярный платеж. Пожалуйста, попробуйте еще раз.',
    ],
    'categories' => [
        'created' => 'Категория создана успешно!',
        'updated' => 'Категория обновлена успешно!',
        'deleted' => 'Категория удалена успешно.',
        'error' => 'Произошла ошибка при попытке сохранить категорию. Пожалуйста, попробуйте еще раз.',
    ],
    'goals' => [
        'created' => 'Цель создана успешно!',
        'updated' => 'Цель обновлена успешно!',
        'deleted' => 'Цель удалена успешно.',
        'error' => 'Произошла ошибка при попытке сохранить цель. Пожалуйста, попробуйте еще раз.',
    ],
    'transactions' => [
        'created' => 'Транзакция создана успешно!',
        'updated' => 'Транзакция обновлена успешно!',
        'deleted' => 'Транзакция удалена успешно.',
        'error' => 'Произошла ошибка при попытке сохранить транзакцию. Пожалуйста, попробуйте еще раз.',
    ],
];
