<?php

return [
    'accounts' => [
        'created' => 'Рахунок створений успішно!',
        'updated' => 'Рахунок оновлений успішно!',
        'deleted' => 'Рахунок видалений успішно.',
        'error' => 'Сталася помилка при спробі зберегти рахунок. Будь ласка, спробуйте ще раз.',
    ],
    'bills' => [
        'created' => 'Регулярний платіж створений успішно!',
        'updated' => 'Регулярний платіж оновлений успішно!',
        'deleted' => 'Регулярний платіж видалений успішно.',
        'error' => 'Сталася помилка при спробі зберегти регулярний платіж. Будь ласка, спробуйте ще раз.',
    ],
    'categories' => [
        'created' => 'Категорія створена успішно!',
        'updated' => 'Категорія оновлена успішно!',
        'deleted' => 'Категорія видалена успішно.',
        'error' => 'Сталася помилка при спробі зберегти категорію. Будь ласка, спробуйте ще раз.',
    ],
    'goals' => [
        'created' => 'Мета створена успішно!',
        'updated' => 'Мета оновлена успішно!',
        'deleted' => 'Мета видалена успішно.',
        'error' => 'Сталася помилка при спробі зберегти мета. Будь ласка, спробуйте ще раз.',
    ],
    'transactions' => [
        'created' => 'Транзакція створена успішно!',
        'updated' => 'Транзакція оновлена успішно!',
        'deleted' => 'Транзакція видалена успішно.',
        'error' => 'Сталася помилка при спробі зберегти транзакцію. Будь ласка, спробуйте ще раз.',
    ],
];
